// задание 1 ***********************************

// let name = prompt("Ваше имя", "");
// alert("Привет, " + name + "!");

// задание 2 ***********************************

// let year = +prompt("Ваш год рождения!", "");
// const YEAR2 = 2019;
// let age = YEAR2 - year;
// alert("Вам лет: " + age);

// задание 3 ***********************************

// let a = prompt("Введите сторону квадрата", "");
// let p2 = "Периметр: ", p = a * 4;
// alert(p2 + p);

// задание 4 ***********************************

// let rad = +prompt("Введите радиус окружности: ", "");
// const PI = 3.14;
// let s = (rad ** 2) * PI;
// alert("Площадь окружности: " + s);

// задание 5 ***********************************

// let s = +prompt("Расстояние: ", "");
// let time = +prompt("Введите время: ", "");
// let speed = s / time;
// alert(speed);

// задание 6 ***********************************

// let doll = +prompt("Доллоры", "");
// const NUM = 1.11;
// let euro = NUM * doll;
// alert("Евро: " + euro);

// задание 7 ***********************************

// let val1 = +prompt("Объем флешки, ГБ: ", "");
// const F = 0.82;
// let val2 = "Количество файлов: ";
// let val3 = val1 / F;
// let val4 = Math.floor (val3);
// alert(val2 + val4);

// задание 8 ***********************************

// let money = +prompt("Введите сумму денег в кошельке", "");
// let price = +prompt("Введите цену одной шоколадки", "");
// let choco = Math.floor(money / price);
// alert("Количество шоколадок, которое можно купить: " + choco);

// задание 9 ***********************************

// let num123 = +prompt("Введите трехзначное число", "");
// let num3 = num123 % 10;
// let num12 = Math.floor(num123 / 10);
// let num2 = num12 % 10;
// let num1 = Math.floor(num12 / 10);
// alert(String(num3) + String(num2) + String(num1));

// задание 10 ***********************************

// let n1 = +prompt("Введите целое число", "");
// n2 = n1 % 2;
// (n2 === 0) && alert("Четное");
// (n2 !== 0) && alert("Нечетное");








